app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
  def index
    @school_classes = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Krusty Krab Training"], ["room_number", 203], ["created_at", "2018-05-22 14:09:01.443378"], ["updated_at", "2018-05-22 14:09:01.443378"]]
---
  def create
    @school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @school_class = SchoolClass.find_by_id(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @school_class = SchoolClass.find_by_id(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-05-22 14:07:24.438068"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find_by_id(params[:id])
    @school_class.update(params.require(:school_class))