app/controllers/students_controller.rb

  def create
    @student = Student.create(params.require(:student).permit(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Rich"], ["last_name", "Nolan"], ["created_at", "2018-01-10 15:48:15.668046"], ["updated_at", "2018-01-10 15:48:15.668046"]]

  def show
    @student = Student.find_by_id(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 3]]

  def edit
    @student = Student.find_by_id(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 3]]

  def update
   @student = Student.find(params[:id])
   @student.update(params.require(:student))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-01-10 15:55:57.169467"], ["id", 1]]